agrondpham/lpc1764-sdcard/KHNLPC1764/src/main.c
	char hour_tam[3];

	char min_tam[3];
	char sec_tam[3];
	char year_tam[3];
	char month_tam[3];
	char day_tam[3];
	char month_tam_1[3];
	init_program();
	RTCInit();

	local_time.RTC_Sec = 56;
	local_time.RTC_Min = 52;
	local_time.RTC_Hour = 10;
	local_time.RTC_Mday = 8;
	//local_time.RTC_Wday = 03;
	//local_time.RTC_Yday = 12; /* current date 07/12/2006 */
	local_time.RTC_Mon = 04;
	local_time.RTC_Year = 2014;
	RTCSetTime(local_time); /* Set local time */

	alarm_time.RTC_Sec = 0;
	alarm_time.RTC_Min = 0;
	alarm_time.RTC_Hour = 0;
	alarm_time.RTC_Mday = 1;
	alarm_time.RTC_Wday = 0;
	alarm_time.RTC_Yday = 1; /* alarm date 01/01/2007 */
	alarm_time.RTC_Mon = 1;
	alarm_time.RTC_Year = 2007;
	RTCSetAlarm(alarm_time); /* set alarm time */

	NVIC_EnableIRQ(RTC_IRQn);

//delay_ms(500);
//Init_SomeThing();
//LED_Config();
	delay_ms(500);
	upload_info();
//delay_ms(500);
//start_up_gsm();

//flash_led();
	RTCStart();

	for (i = 0; i < 5; i++) {
		flash_led();
		delay_ms(1000);
	}
	GPIOSetValue(BUZZER, HIGH);
	delay_ms(50);
	GPIOSetValue(BUZZER, LOW);
	flag_modem.flash_coppy = 1;
	//// test
//	if (flag_modem.modem == not_connect) {
//		start_up_gsm();
//		///if(flag_modem.flash_coppy == 1)
//		//{
//		//flag_modem.flash_coppy = 0;
//		//CopyRAMToFlash(phone_1);
//		//}
//		delay_ms(1000);
//		init_gsm();
//		//UART3_Sendchar('A');
//		//UART3_PrintString("ket thuc main vao while");
//		if (flag_gprs.status_gprs != ok_status) {
//
//			flag_system.led_check = 1;
//			flag_gprs.status_gprs = init_tcp(apn, userName, passApn,
//					flag_gprs.status_gprs);
//			resend++;
//			if (resend >= 2 && flag_gprs.status_gprs != ok_status) {
//				flag_gprs.deactive_pdp = 1;
//				resend = 0;
//			} else if (flag_gprs.status_gprs == ok_status)
//				counter_init = 0;
//			flag_system.led_check = 0;
//		}
//	}
	/////////end

//disk_initialize(0);
	while (1) {
//		current_time = RTCGetTime();
//		sprintf(buffer,"%d/%d/%d",current_time.RTC_Hour,current_time.RTC_Min,current_time.RTC_Sec);
//		UART2_PrintString(buffer);

		if (flag_modem.modem == not_connect) {
			start_up_gsm();
			///if(flag_modem.flash_coppy == 1)
			//{
			//flag_modem.flash_coppy = 0;
			//CopyRAMToFlash(phone_1);
			//}
			delay_ms(1000);
			init_gsm();
			delay_ms(1000);
			///APN
			if (flag_modem.op_selec) {
				flag_modem.op_selec = 0;

				if (strcmp(Selection, viettel) == 0) {
					sprintf(apn, "v-internet");
					sprintf(userName, "");
					sprintf(passApn, "");
				} else if (strcmp(Selection, mobile) == 0
						|| strcmp(Selection, VN_mobile) == 0) {
					sprintf(apn, "m-wap");
					sprintf(userName, "mms");
					sprintf(passApn, "mms");
				} else if (strcmp(Selection, vina) == 0
						|| strcmp(Selection, VN_vina) == 0) {
					sprintf(apn, "m3-world");
					sprintf(userName, "mms");
					sprintf(passApn, "mms");
				} else {
					sprintf(apn, "m-wap");
					sprintf(userName, "mms");
					sprintf(passApn, "mms");
				}
			}

			///END

			//UART3_Sendchar('A');
			//UART3_PrintString("ket thuc main vao while");
			if (flag_gprs.status_gprs != ok_status) {

				flag_system.led_check = 1;
				flag_gprs.status_gprs = init_tcp(apn, userName, passApn,
						flag_gprs.status_gprs);
				resend++;
				if (resend >= 2 && flag_gprs.status_gprs != ok_status) {
					flag_gprs.deactive_pdp = 1;
					resend = 0;
				} else if (flag_gprs.status_gprs == ok_status)
					counter_init = 0;
				flag_system.led_check = 0;
			}
		}
		if (flag_modem.modem == connected) {
			if (flag_modem.error == 1)
				flag_modem.modem = not_connect;
			else
				flag_modem.modem = connected;
			if (flag_system.read_sms == 1) {
				UART0_PrintString("AT+CMGR=1\r");
				flag_system.read_sms = 0;
				delay_ms(1000);			//}
				if (flag_modem.cmgr == 1) {
					flag_modem.cmgr = 0;
					//clearFlash();
					//EraseSectors();
					if (strlen(userCall_new) > 10)
						process_command();
					delay_ms(1000);
					send_sms_func(sms_reply);
					delay_ms(1000);
					UART0_PrintString("AT+CMGDA=\"DEL ALL\"\r");
					flag_system.send_data = 0;
					delay_ms(1000);
					//writeFlash(phone_1);
					if (strcmp(data_flash, ",,,,,,,,,\n\r") != 0) {
						write_basic_infor(data_flash);
					}
				}

				//CopyRAMToFlash(phone_1);
				delay_ms(500);
				//UART0_PrintString("AT\n\r");
				//delay_ms(1000);
				//flag_modem.modem = not_connect;
				//flag_modem.flash_coppy = 1;

			}
//			else if (flag_system.send_data_flag == smsMode) {
//				flag_system.send_data_flag = 0;
//				flag_system.send_data = 0;
//				send_sms_func(sms_reply);
//				delay_ms(1000);
//				UART0_PrintString("AT+CMGDA=\"DEL ALL\"\r");
//				delay_ms(3000);
//			}
			else if (flag_modem.ring) {
				ring_func();
//			for (i = 0; i < phoneLen; i++) {
//				if (phone_1[i] == NULL || phone_1[i] == 0xFF)
//					break;
//				phoneDrive[i] = phone_1[i];
//			}
//			phoneDrive[i] = NULL;

			}
			if (flag_system.send_data || flag_system.change_status) {

				if (flag_gprs.deactive_pdp) {
					sprintf(buffer, "%c", ESC);
					UART0_PrintString(buffer);
					delay_ms(1000);
					UART0_PrintString("AT+CIPSHUT\r");
					delay_ms(1000);
					if (++counter_init >= 5)    // test
							{
						counter_init = 0;

						start_up_gsm();
						flag_modem.modem = not_connect;
					}
					flag_gprs.deactive_pdp = 0;
					flag_gprs.connect_ok = 0;
					flag_gprs.status_gprs = cstt_error;
				} else if (ipServer[0] != NULL
						&& ipServer[0] != 0xFF&& tcpPort[0] != NULL) // thieu xac nhan cac thong so
								{for (vitri = 0; vitri < strlen(imei); vitri++) // kiem tra thanh phan ky tu trong imei
						{             // dung tam bien vitri de lam bien dem
							if (imei[vitri] < 0x30 || imei[vitri] > 0x39) {
								if (check_imei() == 0) // check lai imei neu thay ok thi bat dau gui
								{
									vitri = 0;      // gan i = 0 de cho gui tiep
								} else
								vitri = 1;    // gan = 1 de stop gui
								break;
							}
						}
						if (vitri == 0 || vitri == strlen(imei)) // neu = 0 thi cho gui vi imei dung
						{

							if (connectServer(ipServer, tcpPort) == ok_status) {
								flag_gprs.connect_ok = 1;   // ket noi ok

