agrondpham/lpc1764-sdcard/KHNLPC1764/src/main.c
								memset(data_gps, gpsLen, NULL);// xoa NULL het GPS data

								if(read_basic_infor()==1) {

								} else {
									UART2_PrintString("Co loi xay ra khi in\r\n");
									UART2_PrintString("Ma loi :  bsi-01\r\n");
								}
								sprintf(data_gps,
										"$$KHN$%s,%s,%s,%s,N,%s,E,%s,%d,%d,%d,%d,%s,%s,%d,%d,%s$\r\n",
										version,flash_data.id_device, imei, latitude, longitude,
										speed_gps, oil_value,
										flag_system.status_key,
										flag_system.status_door,
										flag_system.card_status, flash_data.vin_No, flash_data.phone,
										flag_system.cold_hot,flag_system.sleep,time_gps); //,gps_time_string);//gps_date_string,
								//gps_time_string);//time_gps_send);flag_system.sleep
								if (send_data_gprs(data_gps) != ok_status)// send data
								{
									//UART2_PrintString("loi xay ra\r\n");
									flag_gprs.deactive_pdp = 1;// neu send bi loi thi reset lai gprs
								}
								//UART2_PrintString("Khong loi khi gui \r\n");
								delay_ms(1000);
								UART0_PrintString("AT+CIPCLOSE\r");
								resend_gprs = 0;
								flag_gprs.connect_ok = 0;
							} else {
								flag_gprs.connect_ok = 0;  // ket noi bi loi
								flag_gprs.deactive_pdp = 1;
							}
						}   // end cua vitri=0
///start_sdcar
//						switch (WriteData(1, 17022014, 160000)) {
//							case 1:
//							break;
//							case 2:
//							break;
//						}
//						if(f_puts(data_gps, &file)>-1){
//							Close();
//#if _DEBUG==1
//							UART2_PrintString("Write sdcard\r\n");
//#endif
//						}else{
//#if _DEBUG==1
//							UART2_PrintString("CAN NOT Write sdcard\r\n");
//#endif
//						}

						//f_puts(" The gioi that rong lon\r\n",&file);

						////
					}

					flag_system.send_data = 0;
					flag_system.change_status = 0;

				}

			}

				/////// timer/////////////
		if (flag_system.write_data == 1) {

			if (flag_system.gps_detect) {
				if (strlen(gps_time_string) != 6
						|| strlen(gps_date_string) != 6) {
					UART2_PrintString("TIMER_ERROR\r");
					delay_ms(1000);
					goto exit_write_data;
				}
				hour_tam[0] = gps_time_string[0];
				hour_tam[1] = gps_time_string[1];
				hour_tam[2] = NULL;

				min_tam[0] = gps_time_string[2];
				min_tam[1] = gps_time_string[3];
				min_tam[2] = NULL;

				sec_tam[0] = gps_time_string[4];
				sec_tam[1] = gps_time_string[5];
				sec_tam[2] = NULL;

				day_tam[0] = gps_date_string[0];
				day_tam[1] = gps_date_string[1];
				day_tam[2] = NULL;

				month_tam[0] = gps_date_string[2];
				month_tam[1] = gps_date_string[3];
				month_tam[2] = NULL;

				year_tam[0] = gps_date_string[4];
				year_tam[1] = gps_date_string[5];
				year_tam[2] = NULL;

				if (atoi(hour_tam) > 23 || atoi(min_tam) > 59
						|| atoi(sec_tam) > 59 || atoi(day_tam) > 31
						|| atoi(month_tam) > 12 || atoi(year_tam) > 99) {

					memset(data_gps, gpsLen, NULL );
					sprintf(data_gps, "ERROR: %s %s\r", gps_time_string,
							gps_date_string);
					UART2_PrintString(data_gps);
					delay_ms(1000);
					goto exit_write_data;
				}
				a = atoi(hour_tam) + 7;
				if (a >= 24)        // neu gio vuot qua 1 ngay moi
						{
					a = a - 24;    // gio
					b = atoi(day_tam);
					b++;           // ngay
					c = atoi(month_tam);  // thang
					d = atoi(year_tam);
					switch (atoi(month_tam)) {
					case 1:
						if (b > 31) {
							b = 1;
							c++;
						}
						break;
					case 2:
						if (b > 29) {
							b = 1;
							c++;
						}
						break;
					case 3:
						if (b > 31) {
							b = 1;
							c++;
						}
						break;
					case 4:
						if (b > 30) {
							b = 1;
							c++;
						}
						break;

					case 5:
						if (b > 31) {
							b = 1;
							c++;
						}
						break;

					case 6:
						if (b > 30) {
							b = 1;
							c++;
						}
						break;
					case 7:
						if (b > 31) {
							b = 1;
							c++;
						}
						break;

					case 8:
						if (b > 31) {
							b = 1;
							c++;
						}
						break;

					case 9:
						if (b > 30) {
							b = 1;
							c++;
						}
						break;
					case 10:
						if (b > 31) {
							b = 1;
							c++;
						}
						break;

					case 11:
						if (b > 30) {
							b = 1;
							c++;
						}
						break;
					case 12:
						if (b > 31) {
							b = 1;
							c++;
							d++;
						}
						break;

					}

					//sprintf(time_gps, "%02d/%02d/%02d,%02d:%s:%s", d, c, b, a,
					//		min_tam, sec_tam);
					//// ghi SDCARD
					sprintf(time_gps_card, "%02d%s%s", a, min_tam, sec_tam);
					sprintf(day_gps_card, "%s%s%s", b, c, d);
					///////////////

					year = d;
					month = c;
					day = b;
					hour = a;
					min = atoi(min_tam);
					sec = atoi(sec_tam);
				} else {
					//sprintf(time_gps, "%s/%s/%s,%02d:%s:%s", year_tam,
					//		month_tam, day_tam, a, min_tam, sec_tam);
					////// ghi SDCARD
					sprintf(time_gps_card, "%02d%s%s", a, min_tam, sec_tam);
					sprintf(day_gps_card, "%s%s%s", day_tam, month_tam,
							year_tam);
					hour = a;
					min = atoi(min_tam);
					sec = atoi(sec_tam);
					day = atoi(day_tam);
					month = atoi(month_tam);
					year = atoi(year_tam);
					/////////////////
				}
				memset(data_gps, gpsLen, NULL );
				//sprintf(data_gps, "AT+CCLK=\"%s+00\"\r", time_gps);
				//UART0_PrintString(data_gps);
				//UART2_PrintString(time_gps);
				delay_ms(500);
				// UART2_PrintString(time_gps);

			} else {
				//UART0_PrintString("at+cclk?\r");
				delay_ms(1000);
			}
//		                flag_system.status_door =! door;
//		                flag_system.status_key =! key;

			for (vitri = 0; vitri < gpsLen; vitri++)
				data_gps[vitri] = NULL;
			//$3.13,56,862118024728161,1052.0431,N,10641.1769,E,81.00,0,0,0,0,_,000,0,0,050414,080307
//		sprintf(data_gps, "<%s;%s;%s;%s;%d;%d>\r\n", time_gps, latitude,
//				longitude, speed_gps, flag_system.status_key,
//				flag_system.status_door);

//		sprintf(data_gps, "$3.13,56,%s,%s\r\n", imei,time_gps, latitude,
//				longitude, speed_gps, flag_system.status_key,
//				flag_system.status_door);

			if (flag_system.cold_hot == "") {
				flag_system.cold_hot = "_";
			}
			if (flag_system.sleep == "") {
				flag_system.sleep = "_";
			}
			sprintf(data_gps,
					"$%s,56,%s,%s,N,%s,E,%s,%d,%d,%d,%d,%s,%s,%d,%d,%s,%s\r\n",
					version, imei, latitude, longitude, speed_gps, oil_value,
					flag_system.status_key, flag_system.status_door,
					flag_system.card_status, flash_data.vin_No,
					flash_data.phone, flag_system.cold_hot, flag_system.sleep,
					day_gps_card, time_gps_card);			//flash_data.phone
//
//#if _DEBUG==1
//			UART2_PrintString(data_gps);
//#endif

