agrondpham/lpc1764-sdcard/KHNLPC1764/src/main.c
			///start_sdcar
			switch (WriteData(1, atoi(day_gps_card), current_time.RTC_Hour * 10000)) {
			case 1:
				break;
			case 2:
				break;
			}
			if (f_puts(data_gps, &file) > -1) {
				Close();
				flag_system.card_status = 1;
#if _DEBUG==1
				UART2_PrintString("write sdcard\r\n");
#endif
			} else {
				flag_system.card_status = 0;
#if _DEBUG==1
				UART2_PrintString("CAN NOT Write sdcard\r\n");

#endif
			}  //END
			   //READ sdcard
//			switch (ReadData(1, 17022014, 160000)) {
//			case 1:
//				break;
//			case 2:
//				break;
//			}
//			char buffer[256];
//			while (f_gets(buffer, sizeof buffer, &file)) {
//				UART2_PrintString(buffer);
//			}
//
//			////////////////END
			exit_write_data: flag_system.write_data = 0;
			timer_send_gps = 0; // xoa thoi gian gui len data va cho ghi vao the nho

			delay_ms(100);
		}
		//////////end////////

		if (timer_check_sim900 >= counter_check_sim900)   // 10s kiem tra 1 lan
		{
			current_time = RTCGetTime();
//			sprintf(buffer, "%d/%d/%d", current_time.RTC_Hour,
//					current_time.RTC_Min, current_time.RTC_Sec);
			sprintf(time_gps, "%02d/%02d/%d,%02d:%02d:%02d", current_time.RTC_Mday,
					current_time.RTC_Mon, current_time.RTC_Year,
					current_time.RTC_Hour, current_time.RTC_Min,
					current_time.RTC_Sec);
			UART2_PrintString(time_gps);
			start_up_gsm();
			timer_check_sim900 = 0;
			UART0_PrintString("AT+CMGR=1\r");

		}

	}
}

//int main(void) {
//	char line[82];
//	InitPort();
//	SystemInit();
//	KHN_SDCARD_INIT();
//	init_timer(TIMER0_INTERVAL);
//	enable_timer( 0 );
//	UART1_Init();	//GPS
//	UART0_Init();	//SIM900D
//	UART2_Init(9600);	//RS232
//	//{COde demo sdcard
//	disk_initialize(0);
//		// This line of code will return Fil data in &file.Data is in Folder 117032014, filename 16110
//		if(ReadData(1,17032014,161100)) return 0;
//		while (f_gets(line, sizeof line, &file)){
//			DebugPrint(line);
//			DebugPrint("\r\n");
//		}
//		//remeber close file
//		Close();
//						//while(1){}
//		switch(WriteData(1,17022014,160000))	{
//		case 1:
//			break;
//		case 2:
//			break;
//		}
//		f_puts("$GSHT,2,xx,<NGUYEN VAN A,AN234343,00:01:29;105.34344,21.34343,21.34343,04:02:13,105.3464433,21.32343,80>,xxx#\r\n",&file);
//		//f_puts(" The gioi that rong lon\r\n",&file);
//		Close();
////}end sdcard demo
//	while (1) {
//		short_delay(1000);
//		Leds_invert();
//		Read232("READ01031214#");
//		Write232(Buff232.type, "abaabbbbcccccc");
//		//UART0_PrintString("AT\r\n");
//	}
//	return 0;
//}

